qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Maxim/TARGET_MAX32610/max32610.h
#define MXC_GPIO_GET_IRQ(i)             (((unsigned int)i) + GPIO_P0_IRQn)


/*******************************************************************************/
/*                                                      Pulse Train Generation */

#define MXC_CFG_PT_INSTANCES             (13)

#define MXC_BASE_PTG                     ((uint32_t)0x40001000UL)
#define MXC_PTG                          ((mxc_ptg_regs_t *)MXC_BASE_PTG)
#define MXC_BASE_PT                      ((uint32_t)0x40001008UL)
#define MXC_PT                           ((mxc_pt_regs_t *)MXC_BASE_PT)
#define MXC_BASE_PT0                     ((uint32_t)0x40001008UL)
#define MXC_PT0                          ((mxc_pt_regs_t *)MXC_BASE_PT0)
#define MXC_BASE_PT1                     ((uint32_t)0x40001010UL)
#define MXC_PT1                          ((mxc_pt_regs_t *)MXC_BASE_PT1)
#define MXC_BASE_PT2                     ((uint32_t)0x40001018UL)
#define MXC_PT2                          ((mxc_pt_regs_t *)MXC_BASE_PT2)
#define MXC_BASE_PT3                     ((uint32_t)0x40001020UL)
#define MXC_PT3                          ((mxc_pt_regs_t *)MXC_BASE_PT3)
#define MXC_BASE_PT4                     ((uint32_t)0x40001028UL)
#define MXC_PT4                          ((mxc_pt_regs_t *)MXC_BASE_PT4)
#define MXC_BASE_PT5                     ((uint32_t)0x40001030UL)
#define MXC_PT5                          ((mxc_pt_regs_t *)MXC_BASE_PT5)
#define MXC_BASE_PT6                     ((uint32_t)0x40001038UL)
#define MXC_PT6                          ((mxc_pt_regs_t *)MXC_BASE_PT6)
#define MXC_BASE_PT7                     ((uint32_t)0x40001040UL)
#define MXC_PT7                          ((mxc_pt_regs_t *)MXC_BASE_PT7)

/*                                       PT12, PT13, PT14 are not used         */

/*******************************************************************************/
/*                                                        CRC-16/CRC-32 Engine */

#define MXC_BASE_CRC                    ((uint32_t)0x40010000UL)
#define MXC_CRC_REGS                    ((mxc_crc_regs_t *)MXC_BASE_CRC)

#define MXC_BASE_CRC_DATA               ((uint32_t)0x4010B000UL)
#define MXC_CRC_DATA                    ((mxc_crc_data_regs_t *)MXC_BASE_CRC_DATA)

/*******************************************************************************/
/*                                                 Trust Protection Unit (TPU) */

#define MXC_BASE_TPU                     ((uint32_t)0x40011000UL)
#define MXC_TPU                          ((mxc_tpu_regs_t *)MXC_BASE_TPU)

#define MXC_BASE_TPU_TSR                 ((uint32_t)0x40011C00UL)
#define MXC_TPU_TSR                      ((mxc_tpu_tsr_regs_t *)MXC_BASE_TPU_TSR)

/*******************************************************************************/
/*                                                    AES Cryptographic Engine */

#define MXC_BASE_AES                     ((uint32_t)0x40011400UL)
#define MXC_AES                          ((mxc_aes_regs_t *)MXC_BASE_AES)

#define MXC_BASE_AES_MEM                 ((uint32_t)0x4010A000UL)
#define MXC_AES_MEM                      ((mxc_aes_mem_regs_t *)MXC_BASE_AES_MEM)


/*******************************************************************************/
/*                                                    MAA Cryptographic Engine */

#define MXC_BASE_MAA                     ((uint32_t)0x40011800UL)
#define MXC_MAA                          ((mxc_maa_regs_t *)MXC_BASE_MAA)

#define MXC_BASE_MAA_MEM                 ((uint32_t)0x4010A800UL)
#define MXC_MAA_MEM                      ((mxc_maa_mem_regs_t *)MXC_BASE_MAA_MEM)

/*******************************************************************************/
/*                                                    32-Bit PWM Timer/Counter */

#define MXC_CFG_TMR_INSTANCES            (4)

#define MXC_BASE_TMR0                    ((uint32_t)0x40012000UL)
#define MXC_BASE_TMR0_BITBAND            ((uint32_t)0x42240000UL)
#define MXC_TMR0                         ((mxc_tmr_regs_t *) MXC_BASE_TMR0)

#define MXC_BASE_TMR1                    ((uint32_t)0x40013000UL)
#define MXC_BASE_TMR1_BITBAND            ((uint32_t)0x42260000UL)
#define MXC_TMR1                         ((mxc_tmr_regs_t *) MXC_BASE_TMR1)

#define MXC_BASE_TMR2                    ((uint32_t)0x40014000UL)
#define MXC_BASE_TMR2_BITBAND            ((uint32_t)0x42280000UL)
#define MXC_TMR2                         ((mxc_tmr_regs_t *) MXC_BASE_TMR2)

#define MXC_BASE_TMR3                    ((uint32_t)0x40015000UL)
#define MXC_BASE_TMR3_BITBAND            ((uint32_t)0x422A0000UL)
#define MXC_TMR3                         ((mxc_tmr_regs_t *) MXC_BASE_TMR3)


#define MXC_TMR_GET_IRQ_32(i)            ((i) == 0 ? TMR0_IRQn :    \
                                          (i) == 1 ? TMR1_IRQn :    \
                                          (i) == 2 ? TMR2_IRQn :    \
                                          (i) == 3 ? TMR3_IRQn : 0)

#define MXC_TMR_GET_IRQ_16(i)            ((i) == 0 ? TMR0_IRQn :    \
                                          (i) == 1 ? TMR1_IRQn :    \
                                          (i) == 2 ? TMR2_IRQn :    \
                                          (i) == 3 ? TMR3_IRQn :    \
                                          (i) == 4 ? TMR16_0_IRQn :    \
                                          (i) == 5 ? TMR16_1_IRQn :    \
                                          (i) == 6 ? TMR16_2_IRQn :    \
                                          (i) == 7 ? TMR16_3_IRQn : 0)

#define MXC_TMR_GET_BASE(i)              ((i) == 0 ? MXC_BASE_TMR0 : \
                                          (i) == 1 ? MXC_BASE_TMR1 : \
                                          (i) == 2 ? MXC_BASE_TMR2 : \
                                          (i) == 3 ? MXC_BASE_TMR3 : 0)

#define MXC_TMR_GET_TMR(i)               ((i) == 0 ? MXC_TMR0 : \
                                          (i) == 1 ? MXC_TMR1 : \
                                          (i) == 2 ? MXC_TMR2 : \
                                          (i) == 3 ? MXC_TMR3 : 0)
/*******************************************************************************/
/*                                                              Watchdog Timer */

#define MXC_CFG_WDT_INSTANCES            (2)

#define MXC_BASE_WDT0                    ((uint32_t)0x40021000UL)
#define MXC_BASE_WDT0_BITBAND            ((uint32_t)0x42420000UL)
#define MXC_WDT0                         ((mxc_wdt_regs_t *)MXC_BASE_WDT0)

