qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_Maxim/TARGET_MAX32610/max32610.h
#define MXC_I2CM_GET_I2CM(i)             ((i) == 0 ? MXC_I2CM0 :     \
                                          (i) == 1 ? MXC_I2CM1 : 0)

#define MXC_I2CM_GET_BASE_TX_FIFO(i)     ((i) == 0 ? MXC_BASE_I2CM0_TX_FIFO :  \
                                          (i) == 1 ? MXC_BASE_I2CM1_TX_FIFO : 0)

#define MXC_I2CM_GET_BASE_RX_FIFO(i)     ((i) == 0 ? MXC_BASE_I2CM0_RX_FIFO :  \
                                          (i) == 1 ? MXC_BASE_I2CM1_RX_FIFO : 0)

#define MXC_I2CM_INSTANCE_TO_BASE(instance)   (((uint32_t)(instance) << 13) + MXC_BASE_I2CM0)
#define MXC_I2CM_BASE_TO_INSTANCE(base)       (((uint32_t)(base) & 0x00002000) >> 13)


/*******************************************************************************/
/*                                                         I2C Slave Interface */

#define MXC_CFG_I2CS_INSTANCES           (1)

#define MXC_BASE_I2CS0                   ((uint32_t)0x40041000UL)
#define MXC_BASE_I2CS0_BITBAND           ((uint32_t)0x42820000UL)
#define MXC_I2CS0                        ((mxc_i2cs_regs_t *)MXC_BASE_I2CS0)

#define MXC_BASE_I2CS0_FIFO              ((uint32_t)0x40104000UL)
#define MXC_I2CS0_FIFO                   ((mxc_i2cs_fifo_regs_t *)MXC_BASE_I2CS0)



/*******************************************************************************/
/*                                                                        DACs */

#define MXC_CFG_DAC_INSTANCES            (4)
#define MXC_CFG_DAC_FIFO_DEPTH           (32)

#define MXC_BASE_DAC0                    ((uint32_t)0x40050000UL)
#define MXC_DAC0                         ((mxc_dac_regs_t *)MXC_BASE_DAC0)
#define MXC_BASE_DAC0_FIFO               ((uint32_t)0x40105000UL)
#define MXC_DAC0_FIFO                    ((mxc_dac_fifo_regs_t *)MXC_BASE_DAC0_FIFO)
#define MXC_DAC0_WIDTH                   ((uint8_t)(2))

#define MXC_BASE_DAC1                    ((uint32_t)0x40051000UL)
#define MXC_DAC1                         ((mxc_dac_regs_t *)MXC_BASE_DAC1)
#define MXC_BASE_DAC1_FIFO               ((uint32_t)0x40106000UL)
#define MXC_DAC1_FIFO                    ((mxc_dac_fifo_regs_t *)MXC_BASE_DAC1_FIFO)
#define MXC_DAC1_WIDTH                   ((uint8_t)(2))

#define MXC_BASE_DAC2                    ((uint32_t)0x40052000UL)
#define MXC_DAC2                         ((mxc_dac_regs_t *)MXC_BASE_DAC2)
#define MXC_BASE_DAC2_FIFO               ((uint32_t)0x40107000UL)
#define MXC_DAC2_FIFO                    ((mxc_dac_fifo_regs_t *)MXC_BASE_DAC2_FIFO)
#define MXC_DAC2_WIDTH                   ((uint8_t)(1))

#define MXC_BASE_DAC3                    ((uint32_t)0x40053000UL)
#define MXC_DAC3                         ((mxc_dac_regs_t *)MXC_BASE_DAC3)
#define MXC_BASE_DAC3_FIFO               ((uint32_t)0x40108000UL)
#define MXC_DAC3_FIFO                    ((mxc_dac_fifo_regs_t *)MXC_BASE_DAC3_FIFO)
#define MXC_DAC3_WIDTH                   ((uint8_t)(1))


#define MXC_DAC_GET_IRQ(i)               ((i) == 0 ? DAC0_IRQn :     \
                                          (i) == 1 ? DAC1_IRQn :     \
                                          (i) == 2 ? DAC2_IRQn :     \
                                          (i) == 3 ? DAC3_IRQn : 0)


#define MXC_DAC_GET_BASE(i) (i == 0 ? MXC_BASE_DAC0 : \
                             i == 1 ? MXC_BASE_DAC1 : \
                             i == 2 ? MXC_BASE_DAC2 : \
                             i == 3 ? MXC_BASE_DAC3 : 0)

#define MXC_DAC_GET_FIFO(i) (i == 0 ? MXC_BASE_DAC0_FIFO : \
                             i == 1 ? MXC_BASE_DAC1_FIFO : \
                             i == 2 ? MXC_BASE_DAC2_FIFO  : \
                             i == 3 ? MXC_BASE_DAC3_FIFO  : 0)

#define MXC_DAC_GET_PMU_FIFO_IRQ(i) (i == 0 ? PMU_IRQ_DAC0_FIFO_AE : \
                                     i == 1 ? PMU_IRQ_DAC1_FIFO_AE : \
                                     i == 2 ? PMU_IRQ_DAC2_FIFO_AE  : \
                                     i == 3 ? PMU_IRQ_DAC3_FIFO_AE  : 0)

#define MXC_DAC_GET_DAC(i)  (i == 0 ? MXC_DAC0 : \
                             i == 1 ? MXC_DAC1 : \
                             i == 2 ? MXC_DAC2 : \
                             i == 3 ? MXC_DAC3 : 0)

#define MXC_DAC_GET_WIDTH(i)  (i == 0 ? MXC_DAC0_WIDTH : \
                               i == 1 ? MXC_DAC1_WIDTH : \
                               i == 2 ? MXC_DAC2_WIDTH : \
                               i == 3 ? MXC_DAC3_WIDTH : 0)


/*******************************************************************************/
/*                                                            Analog Front End */

#define MXC_BASE_AFE                     ((uint32_t)0x4005401CUL)
#define MXC_AFE                          ((mxc_afe_regs_t *)MXC_BASE_AFE)



/*******************************************************************************/
/*                                                                         ADC */

#define MXC_CFG_ADC_FIFO_DEPTH           ((uint32_t)(32))

#define MXC_BASE_ADC                     ((uint32_t)0x40054000UL)
#define MXC_ADC                          ((mxc_adc_regs_t *)MXC_BASE_ADC)

#define MXC_BASE_ADCCFG                  ((uint32_t)0x40054038UL)
#define MXC_ADCCFG                       ((mxc_adccfg_regs_t *)MXC_BASE_ADCCFG)

#define MXC_BASE_ADC_FIFO                ((uint32_t)0x40109000UL)
#define MXC_ADC_FIFO                     ((mxc_adc_fifo_regs_t *)MXC_BASE_ADC_FIFO)



/*******************************************************************************/
/*                  Peripheral Management Unit (PMU) - formerly DMA Controller */

#define MXC_CFG_PMU_CHANNELS             (6)

#define MXC_BASE_PMU0                    ((uint32_t)0x40070000UL)
#define MXC_PMU0                         ((mxc_pmu_regs_t *)MXC_BASE_PMU0)
#define MXC_BASE_PMU1                    ((uint32_t)0x40070020UL)
#define MXC_PMU1                         ((mxc_pmu_regs_t *)MXC_BASE_PMU1)
#define MXC_BASE_PMU2                    ((uint32_t)0x40070040UL)
#define MXC_PMU2                         ((mxc_pmu_regs_t *)MXC_BASE_PMU2)
#define MXC_BASE_PMU3                    ((uint32_t)0x40070060UL)
#define MXC_PMU3                         ((mxc_pmu_regs_t *)MXC_BASE_PMU3)
#define MXC_BASE_PMU4                    ((uint32_t)0x40070080UL)
#define MXC_PMU4                         ((mxc_pmu_regs_t *)MXC_BASE_PMU4)
#define MXC_BASE_PMU5                    ((uint32_t)0x400700A0UL)
#define MXC_PMU5                         ((mxc_pmu_regs_t *)MXC_BASE_PMU5)

